package ali

var ModelList = []string{
	// ========== 图生视频 (Image to Video) ==========
	// 万相2.6系列 (推荐)
	"wan2.6-i2v-flash", // 万相2.6极速版（有声视频&无声视频）多镜头叙事 720P/1080P 2-15秒
	"wan2.6-i2v",       // 万相2.6专业版（有声视频）多镜头叙事 720P/1080P 2-15秒
	// 万相2.5系列
	"wan2.5-i2v-preview", // 万相2.5 preview（有声视频）480P/720P/1080P 5/10秒
	// 万相2.2系列
	"wan2.2-i2v-flash", // 万相2.2极速版（无声视频）480P/720P/1080P 5秒
	"wan2.2-i2v-plus",  // 万相2.2专业版（无声视频）480P/1080P 5秒
	// 万相2.1系列
	"wanx2.1-i2v-plus",  // 万相2.1专业版（无声视频）720P 5秒
	"wanx2.1-i2v-turbo", // 万相2.1极速版（无声视频）480P/720P 3-5秒

	// ========== 文生视频 (Text to Video) ==========
	// 万相2.6系列 (推荐)
	"wan2.6-t2v", // 万相2.6（有声视频）多镜头叙事 720P/1080P 2-15秒
	// 万相2.5系列
	"wan2.5-t2v-preview", // 万相2.5 preview（有声视频）480P/720P/1080P 5/10秒
	// 万相2.2系列
	"wan2.2-t2v-plus", // 万相2.2专业版（无声视频）480P/1080P 5秒
	// 万相2.1系列
	"wanx2.1-t2v-plus",  // 万相2.1专业版（无声视频）720P 5秒
	"wanx2.1-t2v-turbo", // 万相2.1极速版（无声视频）480P/720P 5秒
}

var ChannelName = "ali"
